Repository: jcansdale-test/publican_creators
Catalog: docs/*/Introduction.po
Languages: de_de

source: Introduction
de_de: Einführung

source: <primary>Introduction</primary>
de_de: <primary>Einleitung</primary>

source: Installing Ruby
de_de: Ruby installieren

source: <primary>Introduction</primary> <secondary>Install Ruby</secondary>
de_de: <primary>Einleitung</primary> <secondary>Ruby installieren</secondary>

source: One of the easiest way to install ruby is by using RVM. So follow the next steps:
de_de: Einer der einfachsten Wege Ruby zu installieren ist mit RVM. Dazu folgen Sie den nächsten Schritten:

source: Type in your console: <command>gpg --keyserver hkp://keys.gnupg.net --recv-keys 409B6B1796C275462A1703113804BB82D39DC0E3</command>
de_de: Geben Sie folgendes in der Konsole ein: <command>gpg --keyserver hkp://keys.gnupg.net --recv-keys 409B6B1796C275462A1703113804BB82D39DC0E3 </command>

source: Type now: <command>curl -sSL https://get.rvm.io | bash -s stable</command>
de_de: Tippen Sie jetzt: <command>curl -sSL https://get.rvm.io | bash -s stable </command>

source: The output should like similar to that one:
de_de: Der Output sollte in etwa so aussehen:

source: If this command fails, you have to install the <package>curl</package> package. Use your package manager to do this.
de_de: Falls das letzte Kommando fehlschlägt, müssen Sie das Paket <package>curl</package> nachinstallieren. Nutzen Sie dazu Ihren Paketmanager.

source: To use RVM you have two options. First you can logout yourself and login again. The other option is just to type: <command>source /home/<replaceable>sascha</replaceable>/.rvm/scripts/rvm</command>. Instead of <quote>sascha</quote> you have to place your username.
de_de: Um RVM zu nutzen haben Sie jetzt 2 Optionen. Entweder loggen Sie sich aus, und wieder ein. Oder aber Sie tippen in die Konsole <command>source /home/<replaceable>sascha</replaceable>/.rvm/scripts/rvm</command>. Statt <quote>sascha</quote> geben Sie Ihren Usernamen ein.

source: Now type: <command>rvm install <replaceable>2.2.1</replaceable></command>. If any later ruby than you can replace the 2.2.1 with the newer version.
de_de: Geben Sie jetzt ein: <command>rvm install <replaceable>2.2.1</replaceable> </command>. Falls mittlerweile ein neueres Ruby als 2.2.1 veröffentlicht wurde, geben Sie diese Version ein.

source: The output shows similar that:
de_de: Der Output sollte in etwa so aussehen:

source: A <command>ruby --version</command> should output your version:
de_de: Ein <command>ruby --version</command> sollte jetzt eine Version ausgeben.

source: Installing PublicanCreators
de_de: PublicanCreators installieren

source: <primary>Introduction</primary> <secondary>Install PublicanCreators</secondary>
de_de: <primary>Einleitung</primary> <secondary>PublicanCreators installieren</secondary>

source: For installing PublicanCreators you now have to type in the console:<command>gem install PublicanCreators</command>. This command solves the soft-dependencies of the program. The output looks similar that one:
de_de: Um PublicanCreators zu installieren, geben Sie folgendes in der Konsole ein: <command>gem install PublicanCreators</command>. Dieses Kommando löst alle Soft-Abhängigkeiten auf. Der Outpus sollte in etwa so aussehen:

source: The installation can takes some time, because some of the dependencies must compiled natively on your computer.
de_de: Die Installation kann (wie die Ruby-Installation) etwas dauern, da manche der Abhängigkeiten nativ auf Ihrem Computer kompiliert werden müssen.

source: Running the setup
de_de: Das Setup

source: <primary>Introduction</primary> <secondary>Running the setup</secondary>
de_de: <primary>Einleitung</primary> <secondary>Das Setup</secondary>

source: For running the setup go to the gem's directory with <command>.rvm/gems/ruby-<replaceable>2.2.1</replaceable>/gems/PublicanCreators-<replaceable>&pcver;</replaceable></command>. Then just type <command>rake setup</command>.
de_de: Um das Setup auszuführen, wechseln Sie in das Verzeichnis des Gems mit <command>.rvm/gems/ruby-<replaceable>2.2.1</replaceable>/gems/PublicanCreators- <replaceable>&pcver;</replaceable>/bin</command>. Hier geben Sie <command>rake setup</command> ein.

source: Keep in mind, that the 2.2.1 from ruby-2.2.1 must match your chosen version. Also you have to replace <replaceable>&pcver;</replaceable> with the installed version of PublicanCreators.
de_de: Bedenken Sie, das die 2.2.1 aus ruby-2.2.1 mit Ihrer Ruby-Version übereinstimmen muss.

source: The setup script does the following:
de_de: Das Setup erledigt die folgenden Dinge:

source: It checks on which host os (Linux) it runs. Then it reacts to that and tried to install the hard dependencies yad and publican.
de_de: Es überprüft, auf welcher Linuxversion es läuft. Dann reagiert es darauf, indem es auf verschiedene Weise die Hard-Dependencies (Linux-Pakete wie yad) installiert.

source: PublicanCreators needs a 4.x version of publican because it uses the parameter <quote>--dtdver</quote>. In case of a Ubuntu host os the setup adds a Launchpad PPA which provides backported versions of publican 4.x for Trusty (14.04) and Utopic (14.10). Vivid Velvet ships a usable publican 4.x version. For other Distributions you have to check if a 4.x version is available for your os. Otherwise PublicanCreators will NOT work.
de_de: PublicanCreators benötigt eine 4.x Version von Publican, da es Parameter wie <quote>--dtdver</quote> benutzt. Falls Sie Ubuntu benutzen, fügt das Setup Programm ein Launchpad PPA hinzu, welches rückportierte Versionen der 4.x Publican Version für Trusty (14.04) und Utopic (14.10) beinhaltet. Vivid Velvet liefert bereits eine passende Version aus.

source: If you have already a <filename>.publicancreators.cfg</filename> in your Homedirectory it will add the actual shipped <filename>.publicancreators.cfg</filename> as .publicancreators.cfg.new in your Homedirectory. You have to check, if new parameters are added or depreached one are there. So modify your old .publicancreators to match the new one.
de_de: Falls Sie bereits ein Konfigurationsfile <filename>.publicancreators.cfg</filename> betreiben, wird die aktuelle <filename>.publicancreators.cfg</filename> als .publicancreators.cfg.new abgespeichert. Nun müssen Sie lediglich die geänderten Parameter in Ihr "altes" File übertragen.

source: The last thing in the setup is to install two *.desktop files for PublicanCreators and RevisionCreator in <filename>.local/share/applications</filename>. This means it will shown in the program launcher.
de_de: Als letzten Schritt legt das Setup_Programm zwei *.desktop Dateien für PublicanCreators und RevisionCreator in <filename>.local/share/applications</filename> an. Daher können Sie beides durch den normalen Programmstarter ausführen.

source: If you aren't have a old .publicancreators.cfg the setup copies a actual version in your Homedirectory and will launch a Texteditor with the config loaded. So you can modify it to your needs. The config file will be explained in the next chapter.
de_de: Falls Sie keine ältere Version der .publicancreators.cfg haben, wird die aktuelle in Ihr Benutzerverzeichnis kopiert, und in einem Texteditor geladen. Dort können Sie Ihre Anpassungen vornehmen. Die Konfigurationsdatei wird im nächsten Kapitel erklärt.

source: The whole setup process looks like that output:
de_de: Der Output sollte in etwa so aussehen:
