Repository: jcansdale-test/publican_creators
Catalog: docs/*/The_Buildscript.po
Languages: de_de

source: The buildscript
de_de: Das Buildscript

source: <primary>The Buildscript</primary>
de_de: <primary>Das Buildscript</primary>

source: The small <filename>Rakefile</filename> script will be placed in each new documentation project, directly under title/language/. The buildscript matches the most common documentation targets like: docx, odt, rtf, wml, pdf, html, man, txt, epub and eclipse.
de_de: Das kleine <filename>Rakefile</filename> Script wird in jeder neuen Dokumentation angelegt (direkt unter titel/sprache). Es kann den Bau der Formate docx, odt, rtf, wml, pdf, html, man, txt, epub und eclipse erleichtern.

source: The export to docx, odt, rtf and wml only working if the <link xlink:href="http://www.xmlmind.com/foconverter/">XMLMind Foconverter (XFC) </link> is installed and a brand (a own brand or the default brand) is installed. Also the <quote>fo2*</quote> scripts should be soft linked to /usr/bin or the path is placed in $PATH.
de_de: Der Export nach docx, odt, rtf und wml funktioniert nur, wenn der <link xlink:href="http://www.xmlmind.com/foconverter/">XMLMind Foconverter (XFC)</link> installiert ist, die <quote>fo2*</quote> in /usr/bin oder in $PATH liegen, und ein Brand gesetzt ist. Hierbei kann es sich um einen angepassten Brand handeln, oder um den Standard fo/docbook.xsl.

source: All other targets like pdf, html, man, txt, epub and eclipse are publican's own targets.
de_de: Alle anderen Exporte wie pdf, html, man, txt, epub and eclipse kann Publican selbst bedienen.

source: The targets will be built into tmp/language/format (e.g. tmp/de-DE/docx). The placeholders (like language) will be solved by producing a new documentation.,
de_de: Die Exporte werden in tmp/sprache/format (z.B. tmp/de-DE/docx) gespeichert.

source: You can integrate the build script in some XML-IDE's. In case of Oxygen XML you can add a external tool with the parameters:
de_de: Das Exportscript kann in manche XML-IDE's (wie z.B. Oxygen XML) als externes Tool integriert werden.

source: Settings for a external pdf tool
de_de: Einstellungen für Oxygen

source: Because the build script is named in each project with the same name it is usable from the IDE. In the same way you can add the two shipped binaries <filename>/usr/bin/publicancreators</filename> and <filename>/usr/bin/publicancreators-dev</filename>.
de_de: Da das Buildscript in jedem Projekt gleich heißt, kann es von der IDE bequem angesteuert werden. Die beiden Dateien <filename>/usr/bin/publicancreators</filename> und <filename>/usr/bin/publicancreators-dev</filename> können ebenfalls beliebig integriert werden.

source: The <filename>Rakefile</filename> looks like:
de_de: Das <filename>Rakefile</filename> sieht wie folgt aus:
