Repository: jcansdale-test/publican_creators
Catalog: doc/*/Running.po
Languages: de_de

source: Using PublicanCreators
de_de: PublicanCreators benutzen

source: <primary>Using PublicanCreators</primary>
de_de: <primary>PublicanCreators benutzen</primary>

source: Launching PublicanCreators
de_de: PublicanCreators starten

source: <primary>Using PublicanCreators</primary> <secondary>Launching PublicanCreators</secondary>
de_de: <primary>PublicanCreators benutzen</primary> <secondary>PublicanCreators starten</secondary>

source: For launching PublicanCreators you have to click on your <menuchoice> <guimenu>Program Launcher</guimenu> <guisubmenu>PublicanCreators</guisubmenu> </menuchoice> .
de_de: Um PublicanCreators zu starten, klicken Sie auf: <menuchoice> <guimenu>program-launcher</guimenu> <guisubmenu>PublicanCreators</guisubmenu> </menuchoice> .

source: Now you see a graphical interface (the look and feel depends on your chosen theme):
de_de: Jetzt sehen Sie ein grafisches Interface (das Aussehen kann je nach eingestelltem Theme variieren).

source: Now you can choose one of that options:
de_de: Jetzt können Sie die Optionen auswählen:

source: <emphasis role="bold">Environment</emphasis>: Work or Private
de_de: <emphasis role="bold">Environment</emphasis>: Work oder Private (Arbeit oder Privat)

source: <emphasis role="bold">Type</emphasis>: Article or Book
de_de: <emphasis role="bold">Type</emphasis>: Article or Book (Artikel oder Buch)

source: <emphasis role="bold">Title</emphasis>:<emphasis>Your Title</emphasis>. You can use a normal entry with blanks, or you can use underscores instead of blanks (Version: 0.4.2.0). But don't use umlauts like "Ä", "Ö", "Ü" or "ß" because Publican just understand ASCII chars.
de_de: <emphasis role="bold">Title</emphasis>:<emphasis>Ihr Titel</emphasis>.. Sie können einen normalen Eintrag mit Leerstellen eintragen, oder Ihren Titel mit Unterstrichen versehen (Version: 0.4.2.0). Sie können aber keine Umlaute wie "Ä", "Ö", "Ü" or "ß" benutze, da Publican nur ASCII Zeichen verarbeitet.

source: You can use the publican.cfg to fix this. If your document is named "Sören und die Ägäis" you can type as title "Soren und die Agais". After the documentation creation is finished, you can add to the publican.cfg
de_de: Sie können die publican.cfg benutzen, um dies zu fixen. Lautet Ihr Dokumentitel "Sören und die Ägäis" können Sie als Titel "Soren und die Agais" eingeben. Nachdem die Dokumentationserstellung beendet ist, können Sie folgendes in Ihre publican.cfg eintragen

source: The chosen name should be the same as your root document. The root document of the example would be named: <filename>Soren_und_die_Agais.xml</filename>. Then you can change the title in the <filename>Article_Info.xml</filename> or <filename>Book_Info.xml</filename> to your needs like <quote>Sören und die Ägäis</quote>. Also it's possible to use <quote>AE</quote> instead of <quote>'Ä</quote> and so on.
de_de: Der gewählte Name solle der des Rootdokumentes sein. Im obigen Beispiel hieße das Roordokument <filename>Soren_und_die_Agais.xml</filename>. Jetzt können Sie in der <filename>Article_Info</filename> oder der <filename>Book_Info.xml</filename> den richtigen Titel <quote>Sören und die Ägäis</quote> eintragen. Ebenso ist es möglich, "AE" statt "Ä" zu benutzen, und so weiter.

source: After clicking on <guibutton>Go!</guibutton> the documentation will be created by publican.
de_de: Nach dem Klick auf <guibutton>Go!</guibutton> wird die Dokumentation mit Publican erstellt.

source: What it does?
de_de: Was macht es?

source: It runs the method <quote>oldconfig</quote> to check if a users configuration file is available. If not, it will break and suggest to run <quote>rake setup</quote>.
de_de: Zuerst startet die Methode <quote>oldconfig</quote> um herauszufinden, ob ein User Configfile existiert. Falls nicht, bricht es ab, und empfiehlt <quote>rake setup</quote> auszuführen.

source: The PublicanCreatorsGet.config method will be launched. The method returns a array which will splitted into the used variables.
de_de: Die PublicanCreatorsGet.config Methode startet, und gibt ein Array zurück. Dieses wird in die intern benutzten Variablen aufgeteilt.

source: The PublicanCreatorsGet.title will be launched. This method returns a array which will be splitted into the variables <quote>environment</quote>, <quote>type</quote>, <quote>opt</quote> and <quote>title</quote>. The <quote>environment</quote> reflects the situation private or work. <quote>type</quote> will be article or book. <quote>opt</quote> can be report, homework or just normal.
de_de: Die jetzt gestartete PublicanCreatorsGet.title gibt ein Array zurück, welches auf die Variablen <quote>environment</quote>, <quote>type</quote>, <quote>opt</quote> und <quote>title</quote> aufgeteilt wird. Die <quote>environment</quote> reflektiert die aktuelle Umgebung Private oder Work. <quote>type</quote> könnte Article oder Book sein. <quote>opt</quote> könnte Report, Homework oder Normal (Leer) sein.

source: The PublicanCreatorsPrepare.prepare will be launched. It will find out what target directory to be used. This depends on your configuration file and your given input from the previous method.
de_de: Jetzt startet die PublicanCreatorsPrepare.prepare Methode, welche herausfindet, welches Zielverzeichnis zu benutzen ist. Dies hängt sowohl von Ihren Einstellungen im Config File ab, als auch von Ihren Eingaben in der GUI.

source: Checker.check is a method who creates the targetdirectory if it doesn't exist.
de_de: Checker.check ist die Methode, welche das Zielverzeichnis erstellt, sofern es noch nicht existiert.

source: With the FileUtils.cd method it jumps into the new created directory.
de_de: Die Methode FileUtils.cd wechselt in das neu erstellte Verzeichnis.

source: Now PublicanCreatorsChange.check_environment checks the environment and runs PublicanCreatorsChange.init_docu_work or PublicanCreatorsChange.init_docu_private for running <command>publican create</command> with all chosen flags.
de_de: Als nächstes startet die Methode PublicanCreatorsChange.check_environment, um gemäß des jeweiligen Environements mittels <command>publican create</command> die Dokumentation zu erstellen.

source: PublicanCreatorsChange.add_entity will work with your TITLE.ent file. If the environment <quote>Work</quote> is chosen, and the variable <quote>global_entities</quote> is filled, it will copy the whole content of the entity file to your new local entity file. The variable <quote>global_entities</quote> can set in your users configuration file.
de_de: PublicanCreatorsChange.add_entity arbeitet jetzt mit Ihrem TITLE.ent File. Falls das Environment <quote>Work</quote> gewählt wurde und die Variable <quote>global_entities</quote> gesetzt wurde, kopiert die Methode den Inhalt des globalen Entityfiles in das lokale Entityfile Ihres neuen Projektes.

source: Next the method PublicanCreatorsChange.change_holder works with your entity file too. In case of private environment it will use your name as HOLDER. Otherwise it uses your companies name.
de_de: Die nächste Methode PublicanCreatorsChange.change arbeitet ebenfalls mit Ihrem Entityfile. Im Fall des Environments "Work" wird der company_name eingetragen, andernfalls ziert Ihr Name die Entität HOLDER.

source: Sometimes its useful to do not use the given legal notice (In case of small documents or reports). If you are in environment <quote>Work</quote> and has chosen <quote>Article</quote> and has set <quote>legal = true</quote> in your configuration file it (PublicanCreatorsChange.remove_legal) will remove the legal notice.
de_de: Manchmal kann es nützlich sein, auf eine vollständige Legal Notice zu verzichten (z.B. für kleinere Dokumente oder Reports). Wenn Sie im Environment <quote>Work</quote> arbeiten, und <quote>Article</quote> auswählten und <quote>legal = true</quote> setzten, wird PublicanCreatorsChange.remove_legal die Legal Notice entfernen.

source: Per default Publican adds some Docbook lines for including a title logo. If you are already defined a Title Logo in your XSL-Stylesheets then you can set <quote>title_logo = false</quote>. Then the method PublicanCreatorsChange.remove_orgname removes the predefined title logo from the Article_Info.xml or Book_Info.xml from your project.
de_de: Standardmäßig fügt Publican einige Docbook Zeilen hinzu, die in einem Titellogo resultiert. Haben SIe Ihr Titellogo bereits in Ihren XSL-Stylesheets definiert, können sie mit <quote>title_logo = false</quote> den Title Logo entfernen.

source: Next step is PublicanCreatorsChange.fix_revhist. In all environments it will use the firstname and surname of the user and replaces them with the default entries in Revision_History.xml. In case of using in environment <quote>Work</quote> it will use your work email address for replacing the default. Otherwise it uses your private address.
de_de: Die nächste Methode PublicanCreatorsChange.fix_revhist ersetzt in der Revision_History.xml die Voreinstellungen für den Vor- und Nachnamen mit Ihrem. Falls das Environment <quote>Work</quote> benutzt wird, wird die Arbeitsemailadresse verwendet, andernfalls Ihre Privatemailadresse.

source: Now the method PublicanCreatorsChange.fix_authorgroup does similar the previous method just for the Author_Group.xml file. In addition it can set the company_name and company_division if chosen.
de_de: Jetzt wird die Methode PublicanCreatorsChange.fix_authorgroup gestartet, die in etwa das tut, wie die vorherige. Jedoch ändert sie die Author_Group.xml. Falls das Environment "Work" gesetzt ist, fügt die Methode den company_name und die company_division hinzu.

source: The last method PublicanCreatorsExport.export_buildscript generates a buildscript for your project.
de_de: Die letzte Methode PublicanCreatorsExport.export_buildscript generiert ein Buildscript für das aktuelle Projekt.

source: Add a revision
de_de: Eine Revision hinzufügen

source: <primary>Using PublicanCreators</primary> <secondary>Add a revision</secondary>
de_de: <primary>PublicanCreators benutzen</primary> <secondary>Eine Revision hinzufügen</secondary>

source: PublicanCreators also ships a graphical revision adder. Just click <menuchoice> <guimenu>program-launcher</guimenu> <guisubmenu>PublicanCreatorsRevision</guisubmenu> </menuchoice> .
de_de: PublicanCreators bietet auch eine grafische Oberfläche zum hinzufügen einer Revision an. Klicken Sie dazu auf: <menuchoice> <guimenu>program-launcher</guimenu><guisubmenu>PublicanCreatorsRevision</guisubmenu> </menuchoice> .

source: There you have three important tweaks:
de_de: Jetzt haben Sie drei wichtige Möglichkeiten:

source: <emphasis role="bold">Projectdir</emphasis>: Use that to move to your <emphasis>target directory</emphasis> (That directory where your projects publican.cfg is)
de_de: <emphasis role="bold">Projectdir</emphasis>: Nutzen Sie diesen Wähler um Ihr <emphasis>Zielverzeichnis</emphasis> (Dort wo Ihre Projektbezogene publican.cfg steckt) auszuwählen.

source: <emphasis role="bold">Commits</emphasis>: There you can place one to five <emphasis>revision texts</emphasis>. If you need more than 5 regularly so file a bug report. You can use a normal entry with blanks, or you can use underscores instead of blanks (Version: 0.4.2.0). There you can use Umlauts.
de_de: <emphasis role="bold">Commits</emphasis>: Hier können SIe bis zu fünf Commit Texte eintragen. Sollten Sie regelmäßg mehr benötigen, tragen Sie bitte einen Bugreport ein. In die Textfelder kann der Text entweder normal, mit Leerzeichen eingetragen werden, oder mit Unterstichen (Version: 0.4.2.0).

source: <emphasis role="bold">Revision number</emphasis>: There you can place your <emphasis>revision number</emphasis>.
de_de: <emphasis role="bold">Revision number</emphasis>: Hier tragen Sie Ihre <emphasis>Revisionsnummer</emphasis> ein.

source: From Version 0.4.4.0 PublicanCreators ships a new feature. The entered Revision number will be splitted internal. If you enter a number like <quote>0.4.1-0</quote> the program splits it into a revision number 0.4.1 and a edition number 0. So the productversion tag in Article_Info.xml or Book_Info.xml will be replaced with the revision number, and the edition field will become the edition value.
de_de: Ab der Version 0.4.4.0 bietet PublicanCreators ein neues automatisches Feature. Die eingegebene Revisionsnummer wird intern gesplittet. Wird beispielsweise eine Revisionsnummer <quote>0.4.1-0</quote> wird die 0.4.1 als Revisionsnummer verwendet, und die 0 als Editionsnummer. In der Article_Info.xml oder Book_Info.xml wird somit die Revisionsnummer als Produktnummer verwendet, und die Edition als Editionsnummer.
